IDEA StatiCa Open Model
Region2D Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Represents a region in two-dimensional space included outline (border) and openings.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Geometry2D.Region2D
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class Region2D : OpenObject
Public Class Region2D
	Inherits OpenObject
public ref class Region2D : public OpenObject
The Region2D type exposes the following members.
Constructors
Name | Description
Region2D
 Constructor
Top
Properties
Name | Description
Openings
 Gets or sets the list of openings in the Region2D.
Outline
 Gets or sets the outline curve of Region2D.
Top
See Also
Reference
IdeaRS.OpenModel.Geometry2D Namespace